# CanRemoveRow Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..CanRemoveRow Method
TableSectionData Class See Also
---
Verifies that if the row at the given index can be removed..
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool CanRemoveRow(
	int nIndex
)
```

Visual Basic
---
```text
Public Function CanRemoveRow ( _
	nIndex As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool CanRemoveRow(
	int nIndex
)
```

# ### Parameters
nIndex
    Type: System..::..Int32 An integer index.
# ### Return Value
True if the row can be removed, false otherwise
# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace